grekichi/raspberry_pi_asm/rp2040/distance/distance.c
#include "rp2040.h"
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>

void PUT32(uint32_t, uint32_t);
uint32_t GET32(uint32_t);
void WFI(void);


static void clock_init(void)
{
    // 125MHzに設定する
    PUT32(CLK_SYS_RESUS_CTRL_RW, 0x00);  // RESUS無効化、time out を0サイクルに設定
    PUT32(XOSC_CTRL_RW, 0xAA0 | (0xFAB << 12));  // 水晶発振器を1-15MHzレンジに設定、水晶発振器enable
    PUT32(XOSC_STARTUP_RW, 0xC4);  // 256 * 196 = 50176 cycles に設定
    while (!(GET32(XOSC_STATUS_RW) & 0x80000000));  // 発振器の動作確認
    PUT32(CLK_REF_CTRL_RW, 0x2);  // SRC -> XOSC_CLKSRC
    
    // PLL_SYSのリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 12);  // ビット12がPLL_SYSに相当
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 12)));

    // PLL_SYSを125MHzに設定する
    PUT32(PLL_SYS_PWR_RW, (1 << 5) | (1 << 3) | (1 << 0));  // PWR 電源off
    PUT32(PLL_SYS_CS_RW, 0);  // REFDIV=1
    PUT32(PLL_SYS_FBDIV_INT_RW, 125);  // VCO=1500MHz *63に設定して、PD2=1にすると同等設定で消費電力を抑えられる
    PUT32(PLL_SYS_PWR_RW, 1 << 3);  // POSTDIVPD=1で保持
    while (!(GET32(PLL_SYS_CS_RW) & (1 << 31)));  // PLLのロック状況を確認
    PUT32(PLL_SYS_PRIM_RW, (6 << 16) | (2 << 12));  // PD1->6, PD2->2
    PUT32(PLL_SYS_PWR_RW, 0);  // Power -> on, PD=0, VCOPD=0, POSTDIVPD=0
    
    PUT32(CLK_SYS_CTRL_CLR, 1 << 0);  // SRCを一旦CLK_REF(=XOSC)に退避する 
    PUT32(CLK_SYS_CTRL_CLR, 0x7 << 5);  // AUXSRC 7:5bits クリア -> PLL_SYS
    PUT32(CLK_SYS_CTRL_RW, (0x0 << 5) | (0x1 << 0));  // AUXSRC -> PLL_SYS, CLKSRC_CLK_SYS_AUX

    PUT32(CLK_PERI_CTRL_CLR, 0x7 << 5);  // AUXSRC 7:5bits クリア -> CLK_SYS
    PUT32(CLK_PERI_CTRL_RW, (1 << 11) | (0x1 << 5));  // enable, CLKSRC_PLL_SYS
}

static void reset_subsys(void)
{
    // IO_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 5);  // ビット５がIO_BANK0に相当
    // IO_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 5)));

    // PADS_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 8);  // ビット8がPADS_BANK0に相当
    // PADS_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 8)));

    // I2C0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 3);  // ビット3がI2C0に相当
    // I2C0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 3)));
}

static void delay_mcrs(uint32_t microsec)
{
    uint32_t start = GET32(TIMER_TIMERAWL_RW);
    while ((GET32(TIMER_TIMERAWL_RW) - start) < microsec);
}

static void led_init(void)
{
    uint32_t ra;

    PUT32(SIO_GPIO_OE_CLR, 1 << 25);  // GPIO25出力を無効化（初期化のための安全動作）
    PUT32(SIO_GPIO_OUT_CLR, 1 << 25);  // GPIO25の値をクリア
    ra = GET32(PADS_BANK0_GPIO25_RW);
    ra ^= 0x40;  // if input disabled then enable
    ra &= 0xC0;  // if output disabled then enable
    PUT32(PADS_BANK0_GPIO25_XOR, ra);
    PUT32(IO_BANK0_GPIO25_CTRL_RW, 5);  // SIO
    PUT32(SIO_GPIO_OE_SET, 1 << 25);  // GPIO25出力を有効化
}

static void uart_init(void)
{
    // uint32_t ra;

    PUT32(RESETS_RESET_CLR, (1 << 22));  // UART0のリセットを解除
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 22)));

    PUT32(UART0_UARTCR_RW, 0x00000000);  // UART初期化
    // ボーレート分周器の設定
    // 水晶発振器(XOSC)使用のため、clk_periの周波数は、125MHz = (125 * 10^6)
    // 通信速度(ボーレート)は、115200 bps に設定
    // 計算方法: clk_periの周波数 / (ボーレート * 16倍)
    // 割った結果の小数部分は、64倍した値を小数ボーレート分周値とする
    // 125000000 / (16 * 115200) = 67.8168
    // 0.8168 * 64 = 52.2752 -> + 0.5 = 52.7752
    PUT32(UART0_UARTIBRD_RW, 67);  // 整数ボーレート分周値
    PUT32(UART0_UARTFBRD_RW, 53);  // 小数ボーレート分周値

    // 0 11 1 0 0 0 0 = (0111 0000) が設定値
    PUT32(UART0_UARTLCR_H_RW, 0x70);  // １フレームのデータビット数 8bits, FIFO有効化, パリティビットなし
    PUT32(UART0_UARTCR_RW, (1 << 9) | (1 << 8) | (1 << 0));  // TXE:有効、RXE:有効

    // ra = GET32(PADS_BANK0_GPIO0_RW);  // UART_TX
    // ra ^= 0x40;  // 0100 0000 : if input disabled then enable
    // ra &= 0xC0;  // 1100 0000 : if output disabled then enable

    // GPIO0の設定
    PUT32(PADS_BANK0_GPIO0_CLR, (1 << 7) | (1 << 6));  // OD/IE -> disable
    PUT32(PADS_BANK0_GPIO0_SET, 1 << 3);  // Pull up enable
    PUT32(IO_BANK0_GPIO0_CTRL_RW, 2);  // UART0_TX

    // GPIO1の設定
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 6);  // IE enable
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 3);  // Pull up enable
    PUT32(IO_BANK0_GPIO1_CTRL_RW, 2);  // UART0_RX
}

static void uart_send(uint32_t x)
{
    while (GET32(UART0_UARTFR_RW) & (1 << 5));
    PUT32(UART0_UARTDR_RW, x);
}

static void uart_send_char(uint8_t x)
{
    while (GET32(UART0_UARTFR_RW) & (1 << 5));
    PUT32(UART0_UARTDR_RW, x);
}

static void uart_send_str(uint8_t *y)
{
    while (*y != '\0')
    {
        uart_send_char(*y);
        y++;
    }
    uart_send_char('\r');
    uart_send_char('\n');
    uart_send_char('\n');
}

static inline void int2bin8(uint8_t val, uint8_t *buf)
{
    uint8_t u = (uint8_t)val;

    for (int i = 0; i < 8; i++)
    {
        buf[i] = ((u >> (7 - i)) & 1) ? '1' : '0';
    }
    buf[8] = '\0';
}


static inline void int2bin16(uint32_t val, uint8_t *buf)
{
    uint32_t u = (uint32_t)val;

    for (int i = 0; i < 16; i++)
    {
        buf[i] = ((u >> (15 - i)) & 1) ? '1' : '0';
    }
    buf[16] = '\0';
}

static inline void int2bin32(uint32_t val, uint8_t *buf)
{
    uint32_t u = (uint32_t)val;

    for (int i = 0; i < 32; i++)
    {
        buf[i] = ((u >> (31 - i)) & 1) ? '1' : '0';
    }
    buf[32] = '\0';
}

static inline void int2str(uint32_t value, uint8_t *buf)
{
    uint8_t i = 0;

    // 桁毎に処理
    uint32_t tens[] = {1000, 100, 10, 1};  //  今回は1000の位まで使用
    uint8_t started = 0;

    for (int j = 0; j < 4; j++)
    {
        uint8_t digit = 0;
        uint32_t v = value;

        while (v >= tens[j])
        {
            v -= tens[j];
            digit++;
        }

        if (digit > 0 || started || j == 2)
        {
            buf[i++] = digit + '0';
            value -= digit * tens[j];  // 次の桁用に減算
            started = 1;
        }
    }

    buf[i] = '\0';
}

static void monitor_init(void)
{
    PUT32(IO_BANK0_GPIO10_CTRL_RW, 5);  // SIO
    PUT32(IO_BANK0_GPIO11_CTRL_RW, 5);  // SIO

    PUT32(SIO_GPIO_OE_CLR, 1 << 10);  // GPIO10出力を無効化
    PUT32(SIO_GPIO_OE_CLR, 1 << 11);  // GPIO11出力を無効化

    PUT32(SIO_GPIO_OUT_CLR, 1 << 10);  // GPIO10の値をクリア
    PUT32(SIO_GPIO_OUT_CLR, 1 << 11);  // GPIO11の値をクリア

    PUT32(SIO_GPIO_OE_SET, 1 << 10);  // GPIO10出力を有効化
    PUT32(SIO_GPIO_OE_SET, 1 << 11);  // GPIO11出力を有効化
}

static void i2c_init(void)
{
    PUT32(I2C0_IC_ENABLE_RW, 0);  // I2C0初期化
    while (GET32(I2C0_IC_ENABLE_RW) & 1);

    // FIFO trigger
    PUT32(I2C0_IC_TX_TL_RW, 0);
    PUT32(I2C0_IC_RX_TL_RW, 0);

    // DMA off
    PUT32(I2C0_IC_DMA_CR_RW, 0);

    // interrupt clear
    GET32(I2C0_IC_CLR_INTR_RW);

    // I2C0をマスターモード、高速モード、7bitアドレス送信 に設定
    PUT32(
        I2C0_IC_CON_RW,
        1 << 0 |  // MASTER_MODE -> enabled
        1 << 1 |  // SPEED -> standard
        0 << 3 |  // IC_10BITADDR_SLAVE -> Slave 7bits addressing mode
        0 << 4 |  // IC_10BITADDR_MASTER -> Master 7bits addressing mode
        1 << 5 |  // IC_RESTART_EN -> enable
        1 << 6 |  // IC_SLAVE_DISABLE -> slave_disabled
        0 << 7 |  // STOP_DET_IFADDRESSED -> disbaled
        1 << 8 |  // TX_EMPTY_CTRL -> enabled
        0 << 9    // RX_FIFO_FULL_HLD_CTRL -> disabled
    );
    // I2C0周波数 100kHzに設定上
    // I2C0 標準モードのSCLクロックのHigh期間カウント
    PUT32(I2C0_IC_SS_SCL_HCNT_RW, 500);  // 500
    // I2C0 標準モードのSCLクロックのLow期間カウント
    PUT32(I2C0_IC_SS_SCL_LCNT_RW, 741);  // 741
    // I2C0 スパイク抑制ロジックによってフィルタリングされる最長スパイクの持続時間
    PUT32(I2C0_IC_FS_SPKLEN_RW, 4);  // 3:32ns 4:40ns 5:48ns
    // I2C0 SDAホールド持続時間
    PUT32(I2C0_IC_SDA_HOLD_RW, 75); // 600ns 最低値は0x1

    // IO_BANK0 setting
    PUT32(IO_BANK0_GPIO4_CTRL_RW, 3);  // I2C0-SDA
    PUT32(IO_BANK0_GPIO5_CTRL_RW, 3);  // I2C0-SCL

    // I2C0を有効化
    PUT32(I2C0_IC_ENABLE_RW, 1);
    while (!(GET32(I2C0_IC_ENABLE_RW) & 1));
}

// スレーブデバイスへの書き込み関数
static inline int write_i2c(const uint8_t address, uint8_t comMsb, uint8_t comLsb)
{
    // TX_FIFOが空くのを確認(TFE -> 0x1)
    while (!(GET32(I2C0_IC_STATUS_RW) & (1 << 2)));

    // ABORT/STOPクリア
    GET32(I2C0_IC_CLR_TX_ABRT_RW);
    GET32(I2C0_IC_CLR_STOP_DET_RW);
    // 割り込み・ABORT完全クリア
    GET32(I2C0_IC_CLR_INTR_RW);

    PUT32(I2C0_IC_ENABLE_RW, 0);
    while (GET32(I2C0_IC_ENABLE_RW) & 1);
    PUT32(I2C0_IC_TAR_RW, (address & 0x7F));
    PUT32(I2C0_IC_ENABLE_RW, 1);  // データ読み込み前に必ずこのレジスタをenableに設定すること
    while (!(GET32(I2C0_IC_ENABLE_RW) & 1));

    // コマンド読み込み
    uint8_t data[2] = {comMsb, comLsb};

    uint32_t i;
    for (i = 0; i < 2; i++)
    {
        uint32_t cmd = data[i];  
        
        // 最初のバイト
        if (i == 0)
        {
            cmd |= (0 << 10);
            cmd |= (0 <<  9);
        }
        // 最後のバイト → STOP
        if (i == 1)
        {
            cmd |= (1 <<  9);
        }

        PUT32(I2C0_IC_DATA_CMD_RW, cmd);

        // TX_TLのしきい値以下確認（CON設定上、実質０確認となる）
        while(!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 4)));  // TX_EMPTY

        // ABORT確認
        uint8_t log[33];
        bool abort = false;
        uint32_t abort_reason = GET32(I2C0_IC_TX_ABRT_SOURCE_RW);
        if (abort_reason != 0)
        {
            int2bin32(abort_reason, log);
            uart_send(0x23);  // DEBUG #
            uart_send_str(log);  // ログ出力
            GET32(I2C0_IC_CLR_TX_ABRT_RW);  // ABORTデータクリア
            abort = true;
            // 発生ABORTチェック
            if (abort_reason & (1 << 0))
            {
                uart_send_str("Write ComMsb NoAck !");  // DEBUG 
            }
            if (abort_reason & (1 << 3))
            {
                uart_send_str("Write ComLsb NoAck !");  // DEBUG 
            }

            // STOP_DET割り込みがアクティブになるのを確認
            while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
            GET32(I2C0_IC_CLR_STOP_DET_RW);

            return -1;  // 書込失敗
        }
        if (abort) break;
    }

    return 0;  // 成功
}

static void dist_sensor_init(void)
{
    // ウォッチドッグの設定(1MHz(=1μs)に設定)
    PUT32(WATCHDOG_TICK_RW, ((1 << 9) | 12));  // clk_tickはclk_refベースのため、XOSCの12(MHz)を設定

    // GPIO設定
    PUT32(IO_BANK0_GPIO14_CTRL_RW, 5);  // SIO Echo set
    PUT32(IO_BANK0_GPIO15_CTRL_RW, 5);  // SIO Trig set

    PUT32(SIO_GPIO_OE_CLR, 1 << 14);  // GPIO14(Echo)出力を無効化
    PUT32(SIO_GPIO_OE_CLR, 1 << 15);  // GPIO15(Trig)出力を無効化(リセット)

    PUT32(SIO_GPIO_OUT_CLR, 1 << 15);  // GPIO15の値をクリア

    PUT32(SIO_GPIO_OE_SET, 1 << 15);  // GPIO15出力を有効化
}

static inline uint32_t get_distance(void)
{
    PUT32(SIO_GPIO_OUT_SET, 1 << 15);  // GPIO15(Trig)をHighにセット
    uint32_t start_pulse = GET32(TIMER_TIMERAWL_RW); 
    while ((GET32(TIMER_TIMERAWL_RW) - start_pulse) < 11);  // 11μs待機 
    PUT32(SIO_GPIO_OUT_CLR, 1 << 15);
    uart_send_str("Trig run");  // DEBUG
    
    uint32_t timeout = GET32(TIMER_TIMERAWL_RW);
    bool chk_timeout = false;
    while (!(GET32(SIO_GPIO_IN) & (1 << 14)))  // GPIO14(Echo)がHighになったか確認
    {
        if ((GET32(TIMER_TIMERAWL_RW) - timeout) > 100000)
        {
            chk_timeout = true;
            break;  // 100ms反応がない場合は終了
        }
    }
    uint32_t start_time = GET32(TIMER_TIMERAWL_RW);
    
    while (GET32(SIO_GPIO_IN) & (1 << 14))  // GPIO14がLowになったか確認
    {
        if ((GET32(TIMER_TIMERAWL_RW) - start_time) > 30000)
        {
            chk_timeout = true;
            break;  // 30ms(=5000mm以上)反応がない場合は終了
        }
    }
    uint32_t end_time = GET32(TIMER_TIMERAWL_RW);
    uart_send_str("time count finished");  // DEBUG
    
    uint32_t elaps, res;
    // uint8_t buf[33];  // DEBUG
    if (chk_timeout == true)
    {
        res = 0;
    }
    else
    {
        elaps = 0;
        elaps = end_time - start_time;
        res = (elaps * 11239) >> 16;  // 343*1000/2/1000000 = 0.1715 ≒ (11239 / 65536)  のため
    }

    return res;  // 単位:mm
}

volatile uint32_t systick_ms = 0;
void Systick_Handler(void)
{
    systick_ms++;
    if (systick_ms >= 1000)
    {
        systick_ms = 0;
        PUT32(SIO_GPIO_OUT_XOR, 1 << 25);  // GPIO25出力を切替
    }
}


int distance(void)
{
    clock_init();
    reset_subsys();
    led_init();
    monitor_init();
    i2c_init();
    // clk_periの有効待ち
    while (!(GET32(CLK_PERI_CTRL_RW) & (1 << 11)));
    // uart_init();
    dist_sensor_init();

    PUT32(SYST_RVR, 125000-1);  // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CVR, 0);         // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CSR, 0x07);      // プロセッサクロック使用、例外ステータス保留、カウンター有効
  
    // モニターのスレーブアドレス
    const uint8_t monitor_addr = 0x3E;
    
    // AQM0802初期設定
    PUT32(SIO_GPIO_OUT_SET, 1 << 11);  // ディスプレイ RESET
    // while (!(GET32(SIO_GPIO_OUT_RW) & (1 << 11)));
    delay_mcrs(40000);  // 40ms待機
    uart_send_str("Monitor Init 1");
    uart_send_str("1-1");  // DEBUG 1
    write_i2c(monitor_addr, 0x00, 0x38);  // Function set -> 8bit bus, 2-line display
    delay_mcrs(30);  // 30μs待機
    uart_send_str("1-2");  // DEBUG 2
    write_i2c(monitor_addr, 0x00, 0x39);  // Function set -> (IS tabel = 1) 拡張機能セット
    delay_mcrs(30);  // 30μs待機
    uart_send_str("1-3");  // DEBUG 3
    write_i2c(monitor_addr, 0x00, 0x14);  // @内蔵発振器の周波数設定 -> bias: 1/5, F2=1: 183Hz(3.0Vの場合)
    delay_mcrs(30);  // 30μs待機
    uart_send_str("1-4");  // DEBUG 4
    write_i2c(monitor_addr, 0x00, 0x73);  // コントラスト設定(Low byte) -> ?
    delay_mcrs(30);  // 30μs待機
    uart_send_str("1-5");  // DEBUG 5
    write_i2c(monitor_addr, 0x00, 0x56);  // @Power,ICONコントロール,コントラスト設定(High byte) -> booster on    
    delay_mcrs(30);  // 30μs待機
    uart_send_str("1-6");  // DEBUG 6
    write_i2c(monitor_addr, 0x00, 0x6C);  // @フォロワー制御 -> 内部フォロワー回路on
    delay_mcrs(200000);  // 200ms待機
    
    uart_send_str("Monitor Init 2");
    uart_send_str("2-1");  // DEBUG 1
    write_i2c(monitor_addr, 0x00, 0x38);  // @Function set ->  標準セット戻し
    delay_mcrs(30);  // 30μs待機
    uart_send_str("2-2");  // DEBUG 2
    write_i2c(monitor_addr, 0x00, 0x0C);  // @ディスプレイ制御 -> ディスプレイon
    delay_mcrs(30);  // 30μs待機
    uart_send_str("2-3");  // DEBUG 3
    write_i2c(monitor_addr, 0x00, 0x01);  // ディスプレイクリア
    delay_mcrs(1100);  // 1.1ms待機
    
    PUT32(SIO_GPIO_OUT_SET, 1 << 10);  // モニター照明ON
    
    //  変数設定
    uint32_t dist = 0;
    uint8_t buf_dist[5];

    while (1)
    {
        WFI();

        // uart_send_str("start distance check");
        dist = get_distance();
        // uart_send_str("finish duration check");
        int2str(dist, buf_dist);
        uart_send_str(buf_dist);
        // 画面クリア
        write_i2c(monitor_addr, 0x00, 0x01);  // ディスプレイクリア
        delay_mcrs(1000);  // 1ms待機
        // 距離記述
        write_i2c(monitor_addr, 0x00, (0x00 | 0x80));
        delay_mcrs(30);  // 30μs待機
        // 整数部
        for (int32_t i = 0; buf_dist[i] != '\0'; i++)
        {
            write_i2c(monitor_addr, 0x40, buf_dist[i]);
        }       
        delay_mcrs(30);  // 30μs待機
        // 記号 m
        write_i2c(monitor_addr, 0x40, 0x6D);        
        delay_mcrs(30);  // 30μs待機
        // 記号 m
        write_i2c(monitor_addr, 0x40, 0x6D);        
        delay_mcrs(30);  // 30μs待機

        // uart_send_str("finish distance check");

        delay_mcrs(1000000);  // 1s待ち
    }

    return 0;
}

//-------------------------------------------------------------------------
// 
// Copyright (c) 2025 grekichi
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------
//
